%% 图3-34
% 平面同向平行射流0-1边界方程
B1x = @(m)(0.1*(1+0.05*m+0.47*m.^2-1.52*m.^3)./(1+1.64*m+1.4*m.^2+0.76*m.^3));
% 平面反向平行射流0-1边界方程
B2x = @(m)(-0.17*(1-0.6*m-0.09*m.^2-0.31*m.^3)./(1+1.64*m+1.4*m.^2+0.76*m.^3));
% 平面反向平行射流0-1边界方程
b1x = @(m)(0.1*(1+1.05*m+1.52*m.^2)./(1+0.64*m+0.76*m.^2));
% 平面反向平行射流0-2边界方程
b2x = @(m)(-0.17*(1+0.4*m+0.31*m.^2)./(1+0.64*m+0.76*m.^2));
% 平面同向伴随射流0-1边界方程
C1x = @(m)(0.112*(1-0.678*m-0.322*m.^2)./(1+m));
% 平面同向伴随射流0-2边界方程
C2x = @(m)(-0.158*(1-1.23*m+0.23*m.^2)./(1+m));
% 平面反向伴随射流0-1边界方程
c1x = @(m)(0.112+0.036*m);
% 平面反向伴随射流0-2边界方程
c2x = @(m)(-0.158+0.036*m);
% 画图
X = 0:0.02:1;
Xa = -1:0.02:0;
hold on;
xlabel('m');
ylabel('b_1/x | b_2/x');
plot(X, B1x(X), 'r-'); 
plot(X, B2x(X), 'b-');
plot(Xa, b1x(Xa), 'r-');
plot(Xa, b2x(Xa), 'b-');
plot(X, C1x(X), 'r--')
plot(X, C2x(X), 'b--');
plot(Xa, c1x(Xa), 'r--');
plot(Xa, c2x(Xa), 'b--');